Revit 2027 API
PipeFittingAndAccessoryPressureDropUIData.Dispose Method
Releases all resources used by the PipeFittingAndAccessoryPressureDropUIData
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Dispose()
Public Sub Dispose
public:
virtual void Dispose() sealed
abstract Dispose : unit -> unit
override Dispose : unit -> unit
Implements
IDisposable.Dispose()
See Also
Reference
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace